internal/cli/testdata/golden/kitchen-sink/architecture.mmd
%% Architecture of kitchen-sink, generated by cloudcc.
flowchart LR
    aws_alb_listener_reporter_web["reporter-web\nalb.listener"]
    aws_alb_targetgroup_reporter_web["reporter-web\nalb.targetgroup"]
    aws_alb_reporter_web(["reporter-web\nalb"])
    aws_apigatewayv2_integration_shop_api["shop-api\napigatewayv2.integration"]
    aws_apigatewayv2_route_shop_api["shop-api\napigatewayv2.route"]
    aws_apigatewayv2_stage_shop_api["shop-api\napigatewayv2.stage"]
    aws_apigatewayv2_shop_api(["shop-api\napigatewayv2"])
    aws_cloudwatch_loggroup_api["api\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_auditor["auditor\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_reporter["reporter\ncloudwatch.loggroup"]
    aws_dynamodb_catalogue[("catalogue\ndynamodb")]
    aws_ecr_reporter["reporter\necr"]
    aws_ecs_cluster_cluster["cluster\necs.cluster"]
    aws_ecs_execrole_reporter_exec["reporter-exec\necs.execrole"]
    aws_ecs_service_reporter["reporter\necs.service"]
    aws_ecs_taskdefinition_reporter["reporter\necs.taskdefinition"]
    aws_ecs_taskpolicy_reporter["reporter\necs.taskpolicy"]
    aws_ecs_taskrole_reporter_task["reporter-task\necs.taskrole"]
    aws_elasticache_itemCache[("itemCache\nelasticache")]
    aws_iam_policy_api["api\niam.policy"]
    aws_iam_policy_auditor["auditor\niam.policy"]
    aws_iam_role_api["api\niam.role"]
    aws_iam_role_auditor["auditor\niam.role"]
    aws_lambda_permission_auditor_itemEvents_sns["auditor-itemEvents-sns\nlambda.permission"]
    aws_lambda_permission_shop_api["shop-api\nlambda.permission"]
    aws_lambda_api["api\nlambda"]
    aws_lambda_auditor["auditor\nlambda"]
    aws_rds_shopdb[("shopdb\nrds")]
    aws_s3_itemDocs[("itemDocs\ns3")]
    aws_secretsmanager_signingKey[("signingKey\nsecretsmanager")]
    aws_sns_subscription_auditor_itemEvents>"auditor-itemEvents\nsns.subscription"]
    aws_sns_itemEvents>"itemEvents\nsns"]
    aws_subnetgroup_elasticache["elasticache\nsubnetgroup"]
    aws_subnetgroup_rds["rds\nsubnetgroup"]
    aws_vpc_gateway_network["network\nvpc.gateway"]
    aws_vpc_routeassoc_network_0["network-0\nvpc.routeassoc"]
    aws_vpc_routeassoc_network_1["network-1\nvpc.routeassoc"]
    aws_vpc_routetable_network["network\nvpc.routetable"]
    aws_vpc_securitygroup_network["network\nvpc.securitygroup"]
    aws_vpc_subnet_network_0["network-0\nvpc.subnet"]
    aws_vpc_subnet_network_1["network-1\nvpc.subnet"]
    aws_vpc_network["network\nvpc"]
    aws_alb_listener_reporter_web --> aws_alb_targetgroup_reporter_web
    aws_alb_listener_reporter_web --> aws_alb_reporter_web
    aws_alb_targetgroup_reporter_web --> aws_vpc_network
    aws_alb_reporter_web --> aws_vpc_securitygroup_network
    aws_alb_reporter_web --> aws_vpc_subnet_network_0
    aws_alb_reporter_web --> aws_vpc_subnet_network_1
    aws_apigatewayv2_integration_shop_api --> aws_apigatewayv2_shop_api
    aws_apigatewayv2_integration_shop_api --> aws_lambda_api
    aws_apigatewayv2_route_shop_api --> aws_apigatewayv2_integration_shop_api
    aws_apigatewayv2_route_shop_api --> aws_apigatewayv2_shop_api
    aws_apigatewayv2_stage_shop_api --> aws_apigatewayv2_route_shop_api
    aws_apigatewayv2_stage_shop_api --> aws_apigatewayv2_shop_api
    aws_ecs_service_reporter --> aws_alb_listener_reporter_web
    aws_ecs_service_reporter --> aws_alb_targetgroup_reporter_web
    aws_ecs_service_reporter --> aws_ecs_cluster_cluster
    aws_ecs_service_reporter --> aws_ecs_taskdefinition_reporter
    aws_ecs_service_reporter --> aws_vpc_securitygroup_network
    aws_ecs_service_reporter --> aws_vpc_subnet_network_0
    aws_ecs_service_reporter --> aws_vpc_subnet_network_1
    aws_ecs_taskdefinition_reporter --> aws_cloudwatch_loggroup_reporter
    aws_ecs_taskdefinition_reporter --> aws_ecr_reporter
    aws_ecs_taskdefinition_reporter --> aws_ecs_execrole_reporter_exec
    aws_ecs_taskdefinition_reporter --> aws_ecs_taskrole_reporter_task
    aws_ecs_taskpolicy_reporter --> aws_dynamodb_catalogue
    aws_ecs_taskpolicy_reporter --> aws_ecs_taskrole_reporter_task
    aws_ecs_taskpolicy_reporter --> aws_rds_shopdb
    aws_ecs_taskpolicy_reporter --> aws_s3_itemDocs
    aws_ecs_taskpolicy_reporter --> aws_secretsmanager_signingKey
    aws_elasticache_itemCache --> aws_subnetgroup_elasticache
    aws_elasticache_itemCache --> aws_vpc_securitygroup_network
    aws_iam_policy_api --> aws_dynamodb_catalogue
    aws_iam_policy_api --> aws_iam_role_api
    aws_iam_policy_api --> aws_rds_shopdb
    aws_iam_policy_api --> aws_s3_itemDocs
    aws_iam_policy_api --> aws_secretsmanager_signingKey
    aws_iam_policy_api --> aws_sns_itemEvents
    aws_iam_policy_auditor --> aws_dynamodb_catalogue
    aws_iam_policy_auditor --> aws_iam_role_auditor
    aws_iam_policy_auditor --> aws_rds_shopdb
    aws_iam_policy_auditor --> aws_s3_itemDocs
    aws_iam_policy_auditor --> aws_secretsmanager_signingKey
    aws_lambda_permission_auditor_itemEvents_sns --> aws_lambda_auditor
    aws_lambda_permission_auditor_itemEvents_sns --> aws_sns_itemEvents
    aws_lambda_permission_shop_api --> aws_apigatewayv2_shop_api
    aws_lambda_permission_shop_api --> aws_lambda_api
    aws_lambda_api --> aws_cloudwatch_loggroup_api
    aws_lambda_api --> aws_iam_role_api
    aws_lambda_auditor --> aws_cloudwatch_loggroup_auditor
    aws_lambda_auditor --> aws_iam_role_auditor
    aws_rds_shopdb --> aws_subnetgroup_rds
    aws_rds_shopdb --> aws_vpc_securitygroup_network
    aws_sns_subscription_auditor_itemEvents --> aws_lambda_auditor
    aws_sns_subscription_auditor_itemEvents --> aws_sns_itemEvents
    aws_subnetgroup_elasticache --> aws_vpc_subnet_network_0
    aws_subnetgroup_elasticache --> aws_vpc_subnet_network_1
    aws_subnetgroup_rds --> aws_vpc_subnet_network_0
    aws_subnetgroup_rds --> aws_vpc_subnet_network_1
    aws_vpc_gateway_network --> aws_vpc_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_subnet_network_0
    aws_vpc_routeassoc_network_1 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_1 --> aws_vpc_subnet_network_1
    aws_vpc_routetable_network --> aws_vpc_gateway_network
    aws_vpc_routetable_network --> aws_vpc_network
    aws_vpc_securitygroup_network --> aws_vpc_network
    aws_vpc_subnet_network_0 --> aws_vpc_network
    aws_vpc_subnet_network_1 --> aws_vpc_network
    aws_ecs_service_reporter -->|uses| aws_dynamodb_catalogue
    aws_ecs_service_reporter -->|uses| aws_elasticache_itemCache
    aws_ecs_service_reporter -->|uses| aws_rds_shopdb
    aws_ecs_service_reporter -->|uses| aws_s3_itemDocs
    aws_ecs_service_reporter -->|uses| aws_secretsmanager_signingKey
    aws_ecs_service_reporter -->|uses| aws_sns_itemEvents
    aws_ecs_taskdefinition_reporter -->|uses| aws_dynamodb_catalogue
    aws_ecs_taskdefinition_reporter -->|uses| aws_elasticache_itemCache
    aws_ecs_taskdefinition_reporter -->|uses| aws_rds_shopdb
    aws_ecs_taskdefinition_reporter -->|uses| aws_s3_itemDocs
    aws_ecs_taskdefinition_reporter -->|uses| aws_secretsmanager_signingKey
    aws_ecs_taskdefinition_reporter -->|uses| aws_sns_itemEvents
    aws_lambda_api -->|uses| aws_dynamodb_catalogue
    aws_lambda_api -->|uses| aws_elasticache_itemCache
    aws_lambda_api -->|uses| aws_rds_shopdb
    aws_lambda_api -->|uses| aws_s3_itemDocs
    aws_lambda_api -->|uses| aws_secretsmanager_signingKey
    aws_lambda_api -->|uses| aws_sns_itemEvents
    aws_lambda_auditor -->|uses| aws_dynamodb_catalogue
    aws_lambda_auditor -->|uses| aws_elasticache_itemCache
    aws_lambda_auditor -->|uses| aws_rds_shopdb
    aws_lambda_auditor -->|uses| aws_s3_itemDocs
    aws_lambda_auditor -->|uses| aws_secretsmanager_signingKey
    aws_lambda_auditor -->|uses| aws_sns_itemEvents
